var app = new Vue({
  el: '#app',
  data: {
    cyr: 'Бұл жасқа келгенше жақсы өткіздік пе, жаман өткіздік пе, әйтеуір бірталай өмірімізді өткіздік: алыстық, жұлыстық, айтыстық, тартыстық - әурешілікті көре-көре келдік. Енді жер ортасы жасқа келдік: қажыдық, жалықтық; қылып жүрген ісіміздің баянсызын, байлаусызын көрдік, бәрі қоршылық екенін білдік. Ал, енді қалған өмірімізді қайтіп, не қылып өткіземіз? Соны таба алмай өзім де қайранмын.',
    lat: '',
    letters: {
      А: 'A',
      а: 'a',
      Ә: "A'",
      ә: "a'",
      Б: 'B',
      б: 'b',
      Д: 'D',
      д: 'd',
      Е: 'E',
      е: 'e',
      Ё: 'E',
      ё: 'e',
      Ф: 'F',
      ф: 'f',
      Ғ: "G'",
      ғ: "g'",
      Г: 'G',
      г: 'g',
      Х: 'H',
      х: 'h',
      І: 'I',
      i: 'i',
      І: 'I',
      i: 'i',
      И: "I'",
      и: "i'",
      Й: "I'",
      й: "i'",
      H: 'H',
      h: 'h',
      Ж: 'J',
      ж: 'j',
      К: 'K',
      к: 'k',
      Л: 'L',
      л: 'l',
      М: 'M',
      м: 'm',
      Н: 'N',
      н: 'n',
      Ң: "N'",
      ң: "n'",
      О: 'O',
      о: 'o',
      Ө: "O'",
      ө: "o'",
      П: 'P',
      п: 'p',
      Қ: 'Q',
      қ: 'q',
      Р: 'R',
      р: 'r',
      Ш: "S'",
      ш: "s'",
      С: 'S',
      с: 's',
      Т: 'T',
      т: 't',
      Ұ: 'U',
      ұ: 'u',
      Ү: "U'",
      ү: "u'",
      В: 'V',
      в: 'v',
      Ы: 'Y',
      ы: 'y',
      У: "Y'",
      у: "y'",
      З: 'Z',
      з: 'z',
      Ч: "C'",
      ч: "c'",
      Э: 'E',
      э: 'e',
      Щ: "s'",
      щ: "s'",
      ь: '',
      ъ: '',
      Я: "I'a",
      я: "i'a",
      Ю: "I'y'",
      ю: "i'y'",
      Ц: 'Ts',
      ц: 'ts'
    }
  },
  mounted: function() {
    String.prototype.convert = function(prev, next) {
      return this.split(prev).join(next);
    };
    this.submit();
  },
  methods: {
    submit: function() {
      var result = new String(this.cyr);

      for (var key in this.letters) {
        result = result.convert(
          key.toString(),
          this.letters[key]
        );
      }

      this.lat = result;
    }
  }
});
